# x_k = 1 - 1/2 + 1/3 - ... + (-1)^k 1/k


def recurrently(k):
    """ Знаходження елементів послідовності використовуючи
            рекурентні співвідношення
        :param k: Номер члена послідовності, що необхідно знайти
        :return:  Знайдений член послідовності. """
    a = 1  # початкове значення
    t = 1
    for i in range(2, k + 1):
        t *= -1
        a += t / i
    return a


def generator(k):
    """ Генератор """
    a = 1  # початкове значення
    t = 1
    yield a
    for i in range(2, k + 1):
        t *= -1
        a += t / i  # обчилюємо наступний член послідовності
        yield a  # повертаємо поточний член послідовності


# Головна програма
n = int(input("n = "))
print()
print(recurrently(n))
print()
for el in generator(n):
    print(el)
