"""Скласти програму для роботи з базою даних, що містить комунальні платежі. У
БД зберігаються назви компаній, неформальні назви платежів, а також рахунки від
компаній разом з відомостями про оплату. Для кожного рахунку вказують: компанію,
неформальну назву платежу, дату рахунку, суму рахунку, дату оплати, суму оплати.
Реалізувати функції додавання компанії, додавання неформальної назви платежу,
додавання рахунку, сплати рахунку, показу усіх рахунків за заданий місяць та рік, а
також загальної суми рахунків та сплаченої суми."""


